src/cf/InformationRegisters/ИсключенияИзПравилПубликацииКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсключенияИзПравилПубликацииКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоОтветственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсключенияИзПравилПубликацииКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОтветственного(ТекущийОтветственный, НовыйОтветственный) Экспорт

	ФизическиеЛица = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекущийОтветственный) Тогда
		Запись = РегистрыСведений.ИсключенияИзПравилПубликацииКабинетСотрудника.СоздатьМенеджерЗаписи();
		Запись.ФизическоеЛицо = ТекущийОтветственный;
		Запись.Удалить();
		ФизическиеЛица.Добавить(ТекущийОтветственный);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйОтветственный) Тогда
		Запись = РегистрыСведений.ИсключенияИзПравилПубликацииКабинетСотрудника.СоздатьМенеджерЗаписи();
		Запись.ФизическоеЛицо = НовыйОтветственный;
		Запись.Публикуется 		= Истина;
		Запись.ЭтоОтветственный = Истина;
		Запись.Записать();
		Физическиелица.Добавить(НовыйОтветственный);
	КонецЕсли;
	
	ИнтеграцияКабинетСотрудника.ОбновитьСведенияОПубликацииФизическихЛицИсключений(ФизическиеЛица);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
